src/InformationRegisters/ar_Запуски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ar_Запуски</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ar_Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ar_СтатусЗапуска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОтветLLM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_АгентРеф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_Агенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_СтартовалВ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЗавершенВ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Триггер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПользовательРеф</Name>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТокеновВход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТокеновВыход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_СтоимостьРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ШаговВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_РодительскийИдентификаторЗапуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_StateSnapshot</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПоследнийПульс</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПрофильЗапуска</Name>
					<Comment>Профиль запуска (CONS-01), определивший ответственного и область данных этого запуска. Пустая ссылка — профиль не указан (обратная совместимость, CONS-02).</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_ПрофилиЗапуска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПопытокВозобновления</Name>
					<Comment>Счётчик повторов техсбоя (§3.5) и предохранитель третьего слоя детекции прогресса — потолок 10 продолжений (§3.3, CONS-11). Заполняется ar_Планировщик.ОбработатьАвтовозобновление (CONS-09).</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПродолженийСделано</Name>
					<Comment>CONS-11: счётчик фактических продолжений цикла по вердикту Продолжить надзора (§3.3) — предохранитель слоя 3, потолок 10. НЕ путать с ar_ПопытокВозобновления (CONS-09, счётчик техповторов, потолок 3) — разные счётчики по решению аналитика/оркестратора, во избежание рассинхрона двух независимых механизмов. Не сбрасывается при автовозобновлении техсбоя (ar_Планировщик.ОбработатьАвтовозобновление).</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПоследнееРешениеНадзора</Name>
					<Comment>Каноническое имя значения ar_ВердиктНадзора (или пусто, если надзор ещё не вызывался) — хранится строкой, а не ссылкой на перечисление, чтобы консоль показывала решение без join (план §5.1). Заполняется ar_Надзор (CONS-10).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОтпечатокШага</Name>
					<Comment>Хэш «имя tool + хэш аргументов + хэш результата» последнего шага — основа result-aware детекции застревания (§3.3, CONS-11). 64 символа — под hex SHA-256.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПовторитьПосле</Name>
					<Comment>Момент следующей попытки при временном техсбое (сеть, таймаут, 429/5xx); пусто — повтор не запланирован (§3.5). Читает и пишет ar_Планировщик.ОбработатьАвтовозобновление (CONS-09).</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТекущийЭтап</Name>
					<Comment>PLAN-01: название текущего этапа плана (заголовок пункта) — для быстрого отображения без join (план §5.1). Заполняется ar_RuntimeЦикл (PLAN-04) из ar_ПланЗапуска.ТекущийПункт (PLAN-02, пока не реализован). Полный план не хранится в регистре — восстанавливается из последнего события PlanUpdated в ar_СобытияЗапуска. Пусто для запусков без плана.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЭтаповВсего</Name>
					<Comment>PLAN-01: общее количество этапов плана. Заполняется ar_RuntimeЦикл (PLAN-04) из ar_ПланЗапуска.Прогресс (PLAN-02, пока не реализован). 0 — план не объявлен или запуск без планирования. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЭтаповЗакрыто</Name>
					<Comment>PLAN-01: количество завершённых этапов плана. Заполняется ar_RuntimeЦикл (PLAN-04) из ar_ПланЗапуска.Прогресс (PLAN-02, пока не реализован). 0 — план не объявлен или запуск без планирования. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОжидаетСобытия</Name>
					<Comment>PLAN-10: JSON-строка вида {\"object_type\": \"Справочник.Контрагенты\", \"filter\": {\"Наименование\": \"ООО Ромашка\"}} - тип объекта + плоский фильтр без операторов, по аналогии с ar_ОбработчикПодписок.ГорячиеТипы/ПроверитьФильтр. Заполняется ar_RuntimeЦикл/ar_ИнструментыПлан при вызове tool wait_for_event(object_type, filter, deadline_hours) (PLAN-11, пока не реализован). Пусто, если запуск не в PausedForEvent. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОжиданиеДо</Name>
					<Comment>PLAN-10: дедлайн ожидания события, DateTime (точность до секунды - deadline_hours в часах, PLAN-11). Заполняется ar_RuntimeЦикл при вызове tool wait_for_event как ТекущаяДата() + deadline_hours часов (PLAN-11, пока не реализован). Сравнивается с ТекущаяДата() в регламентном задании проверки дедлайна (PLAN-13). Пусто, если запуск не в PausedForEvent. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Диалог</Name>					<Type>
						<v8:Type>cfg:CatalogRef.ar_Диалоги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Предмет</Name>					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ar_ИдентификаторЗапуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ar_AuditЗапуски/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// AgentRunner для 1С
//
// Лицензия: MIT. Полный текст — в файле LICENSE в корне репозитория.
//
// Исходный код проекта:
// https://github.com/AI-1C-Expert/agentrunner
///////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Общий модуль ar_AuditЗапуски (Аудит запусков агентов).
//
// Единственная точка записи жизненного цикла запуска агента в регистр сведений
// ar_Запуски. Запись должна выполняться независимо от прав пользователя сессии
// (Reader-роль не имеет права добавления записей) — привилегию поднимает
// вызывающий код точечно, не сам модуль.
//
// Свойства модуля: Сервер, Привилегированный = Ложь (AUD-06: платформа
// запрещает Privileged=true в общих модулях расширений - "Cannot use
// privileged common modules in extensions", проверено при загрузке .cfe в
// реальную ИБ). Привилегии поднимает вызывающий код точечно -
// УстановитьПривилегированныйРежим(Истина)/Попытка...Исключение...(Ложь)/
// КонецПопытки/(Ложь) - через фасад ar_AuditЗащищённыйРежим
// (ЗаписатьСтатусЗапускаПривилегированно, СоздатьЗапускПривилегированно,
// СохранитьСнимокПривилегированно) там, где он подключён, либо локально в
// вызывающем модуле (например Heartbeat в ar_RuntimeЦикл). Точки чтения
// (ПрочитатьСнимок) намеренно НЕ оборачиваются привилегиями - работают на
// правах Read, доступных всем операционным ролям. Ранее (AUD-01/AUD-04/AUD-05)
// привилегия выставлялась в манифесте - см. AUD-06 для истории смены механизма.
//
// Контракт API: см. AUD-01.md, META-14.md. Параметры — ИдентификаторЗапуска (UUID-строка
// длиной 36) и СтруктураДанных с набором ключей, соответствующих ресурсам
// регистра ar_Запуски. Полный список — в спеке META-14.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Создать запись о запуске агента.
//
// Параметры:
//  ИдентификаторЗапуска - Строка - идентификатор запуска (UUID, длина 36). Обязателен.
//  СтруктураДанных   - Структура - данные запуска:
//                        * Статус           - ПеречислениеСсылка.ar_СтатусЗапуска
//                                              или Строка (имя значения перечисления). Обязателен.
//                        * АгентРеф         - СправочникСсылка.ar_Агенты. Опционально.
//                        * СтартовалВ       - Дата. По умолчанию ТекущаяДатаСеанса().
//                        * Триггер          - Строка (manual/cron/webhook/mention/approval_resume).
//                                              По умолчанию "manual".
//                        * ПользовательРеф  - СправочникСсылка.Пользователи. Опционально.
//                        * РодительскийИдентификаторЗапуска - Строка(36). Опционально.
//                        * ОтветLLM         - Строка. Опционально.
//                        * ПрофильЗапуска   - СправочникСсылка.ar_ПрофилиЗапуска. Опционально
//                                              (CONS-02); пустая ссылка/отсутствие ключа - профиль
//                                              не указан, поведение как до CONS-02.
//
// Возвращаемое значение: нет.
//
Процедура Создать(ИдентификаторЗапуска, СтруктураДанных) Экспорт

	ПроверитьПараметры(ИдентификаторЗапуска, СтруктураДанных);

	// Значения по умолчанию для создания.
	Если Не СтруктураДанных.Свойство("СтартовалВ") Или Не ЗначениеЗаполнено(СтруктураДанных.СтартовалВ) Тогда
		СтруктураДанных.Вставить("СтартовалВ", ТекущаяДатаСеанса());
	КонецЕсли;
	Если Не СтруктураДанных.Свойство("Триггер") Или ПустаяСтрока(СтруктураДанных.Триггер) Тогда
		СтруктураДанных.Вставить("Триггер", "manual");
	КонецЕсли;
	// ПоследнийПульс = СтартовалВ, чтобы sweeper не поймал только что стартовавший запуск.
	Если Не СтруктураДанных.Свойство("ПоследнийПульс") Тогда
		СтруктураДанных.Вставить("ПоследнийПульс", СтруктураДанных.СтартовалВ);
	КонецЕсли;

	// agentrunner-26 п.4: дочерний запуск наследует диалог и предмет родителя.
	НаследоватьДанныеРодителя(ИдентификаторЗапуска, СтруктураДанных);

	ЗаписатьЗапуск(ИдентификаторЗапуска, СтруктураДанных);

КонецПроцедуры

// Завершить (обновить) запись о запуске агента.
//
// При отсутствии записи с указанным ИдентификаторЗапуска создаёт новую — операция идемпотентна.
//
// Параметры:
//  ИдентификаторЗапуска - Строка - идентификатор запуска (UUID, длина 36). Обязателен.
//  СтруктураДанных   - Структура - данные запуска:
//                        * Статус           - ПеречислениеСсылка.ar_СтатусЗапуска или Строка. Обязателен.
//                        * ЗавершенВ        - Дата. По умолчанию ТекущаяДатаСеанса().
//                        * ОтветLLM         - Строка. Опционально.
//                        * ТокеновВход      - Число. Опционально.
//                        * ТокеновВыход     - Число. Опционально.
//                        * СтоимостьРуб     - Число. Опционально.
//                        * ШаговВсего       - Число. Опционально.
//                        * РодительскийИдентификаторЗапуска - Строка(36). Опционально.
//
// Возвращаемое значение: нет.
//
Процедура Завершить(ИдентификаторЗапуска, СтруктураДанных) Экспорт

	ПроверитьПараметры(ИдентификаторЗапуска, СтруктураДанных);

	Если Не СтруктураДанных.Свойство("ЗавершенВ") Или Не ЗначениеЗаполнено(СтруктураДанных.ЗавершенВ) Тогда
		СтруктураДанных.Вставить("ЗавершенВ", ТекущаяДатаСеанса());
	КонецЕсли;

	ЗаписатьЗапуск(ИдентификаторЗапуска, СтруктураДанных);

КонецПроцедуры

// Обновить отметку ar_ПоследнийПульс для запуска. Вызывается после каждого
// шага цикла рассуждения (RT-06/RT-07).
//
// При отсутствии записи с указанным ИдентификаторЗапуска — молча фиксирует событие в журнале
// регистрации без выброса исключения (см. граничные случаи в META-14).
//
// Параметры:
//  ИдентификаторЗапуска - Строка - идентификатор запуска. Обязателен.
//
Процедура Heartbeat(ИдентификаторЗапуска) Экспорт

	ПроверитьИдентификаторЗапуска(ИдентификаторЗапуска);

	ЗаписьНайдена = Ложь;

	НачатьТранзакцию();
	Попытка

		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ar_Запуски");
		ЭлементБлокировки.УстановитьЗначение("ar_ИдентификаторЗапуска", ИдентификаторЗапуска);
		Блокировка.Заблокировать();

		МенеджерЗаписи = РегистрыСведений.ar_Запуски.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ar_ИдентификаторЗапуска = ИдентификаторЗапуска;
		МенеджерЗаписи.Прочитать();

		Если МенеджерЗаписи.Выбран() Тогда
			ЗаписьНайдена = Истина;
			МенеджерЗаписи.ar_ПоследнийПульс = ТекущаяДатаСеанса();
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	// Запись не найдена — пишем предупреждение в журнал и выходим без исключения,
	// чтобы не прерывать цикл рассуждения (см. граничные случаи META-14).
	// Логирование вынесено за пределы транзакции (std783, std498).
	Если Не ЗаписьНайдена Тогда
		ТекстПредупреждения = СтрШаблон(
			НСтр("ru = 'Heartbeat для несуществующего идентификатора запуска: %1';
				|en = 'Heartbeat for missing run id: %1'"),
			ИдентификаторЗапуска);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'ar_AuditЗапуски.Heartbeat'; en = 'ar_AuditЗапуски.Heartbeat'"),
			УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.РегистрыСведений.ar_Запуски,
			,
			ТекстПредупреждения);
	КонецЕсли;

КонецПроцедуры

// Прервать запуск — установить Статус = Interrupted и ЗавершенВ = ТекущаяДатаСеанса().
// Используется регламентным заданием ar_ОчисткаЗависших (SCHED-04) и ручной
// командой UI.
//
// Защита от гонки: если запуск уже в финальном статусе (Completed, Failed,
// Cancelled, Interrupted, FailedIncompatibleState) — данные не перезаписываются,
// в журнал пишется Предупреждение. Это предотвращает перезатирание корректно
// завершившегося запуска отметкой Interrupted при одновременном тике sweeper-а
// и нормальном завершении фонового задания (SCHED-04, UC-3).
//
// Параметры:
//  ИдентификаторЗапуска - Строка - идентификатор запуска. Обязателен.
//
Процедура ПрерватьЗапуск(ИдентификаторЗапуска) Экспорт

	ПроверитьИдентификаторЗапуска(ИдентификаторЗапуска);

	// Статус-флаг для логирования за пределами транзакции (std783, std498):
	//   "final"   - запуск уже в финальном статусе, отметка не применена;
	//   "missing" - записи запуска нет, отметка не применена;
	//   ""        - отметка Interrupted применена штатно.
	ИтогОперации = "";

	НачатьТранзакцию();
	Попытка

		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ar_Запуски");
		ЭлементБлокировки.УстановитьЗначение("ar_ИдентификаторЗапуска", ИдентификаторЗапуска);
		Блокировка.Заблокировать();

		МенеджерЗаписи = РегистрыСведений.ar_Запуски.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ar_ИдентификаторЗапуска = ИдентификаторЗапуска;
		МенеджерЗаписи.Прочитать();

		Если Не МенеджерЗаписи.Выбран() Тогда
			// Записи запуска нет — фантомную запись Interrupted не создаём.
			ИтогОперации = "missing";
		ИначеЕсли ЭтоФинальныйСтатус(МенеджерЗаписи.ar_Статус) Тогда
			ИтогОперации = "final";
		Иначе
			МенеджерЗаписи.ar_Статус = Перечисления.ar_СтатусЗапуска.Прерван;
			МенеджерЗаписи.ar_ЗавершенВ = ТекущаяДатаСеанса();
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	// Логирование вынесено за пределы транзакции (std783, std498).
	Если ИтогОперации = "final" Тогда
		ТекстПредупреждения = СтрШаблон(
			НСтр("ru = 'Прервать: запуск %1 уже в финальном статусе, отметка Interrupted не применяется';
				|en = 'Abort: run %1 already in a final status, Interrupted mark skipped'"),
			ИдентификаторЗапуска);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'ar_AuditЗапуски.ПрерватьЗапуск'; en = 'ar_AuditЗапуски.Abort'"),
			УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.РегистрыСведений.ar_Запуски,
			,
			ТекстПредупреждения);
	ИначеЕсли ИтогОперации = "missing" Тогда
		ТекстПредупреждения = СтрШаблон(
			НСтр("ru = 'Прервать: запись запуска %1 не найдена, отметка Interrupted не применяется';
				|en = 'Abort: run record %1 not found, Interrupted mark skipped'"),
			ИдентификаторЗапуска);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'ar_AuditЗапуски.ПрерватьЗапуск'; en = 'ar_AuditЗапуски.Abort'"),
			УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.РегистрыСведений.ar_Запуски,
			,
			ТекстПредупреждения);
	КонецЕсли;

КонецПроцедуры

// PLAN-06 (итерация 2): записать прогресс плана немедленно, в момент
// успешного update_plan - НЕ дожидаясь ЗавершитьЗапуск/ПрерватьЗапуск.
//
// Зачем отдельная процедура, а не Завершить/ЗаписатьЗапуск: путь прерывания
// запуска (Отменить/sweeper SCHED-04/фейл постановки задания) вызывает
// ar_AuditЗащищённыйРежим.ЗаписатьСтатусЗапускаПривилегированно(ИдентификаторЗапуска, "Прервать")
// БЕЗ ДополнительныеДанные - там нет доступа к живому Состояние цикла, поэтому
// прогресс плана, вставленный ar_RuntimeЦикл.ДополнитьДаннымиПлана только в
// ЗавершитьЗапуск, на этом пути никогда не записывался (найденный дефект
// PLAN-06). Independent-of-outcome запись прогресса на КАЖДЫЙ успешный
// update_plan закрывает разрыв: колонка «Этап» в консоли актуальна уже к
// моменту первого вызова инструмента, а не только при штатном завершении.
//
// Пишет ТОЛЬКО три ресурса плана - НЕ трогает ar_Статус/ar_ЗавершенВ (в
// отличие от Завершить, которая требует непустой Статус и всегда проставляет
// ЗавершенВ - использование для промежуточной записи на живом Running-запуске
// испортило бы семантику завершения).
//
// Намеренно НЕ создаёт запись, если ИдентификаторЗапуска не найден (по образцу Heartbeat) -
// при отсутствии молча фиксирует Предупреждение в журнал регистрации, не
// выбрасывая исключение (не должна прерывать цикл рассуждения). Это
// безопасно: единственный вызывающий (ar_RuntimeЦикл.ОбработатьРезультатUpdatePlan)
// срабатывает только ПОСЛЕ успешного tool-вызова update_plan внутри уже
// стартовавшего фонового задания - запись ar_Запуски к этому моменту всегда
// существует (создана ar_AuditЗащищённыйРежим.СоздатьЗапускПривилегированно в
// ar_RuntimeЗапуск.ЗапуститьВФоне до постановки задания). Отсутствие записи
// означало бы рассинхронизацию данных за пределами контракта этой функции.
//
// Параметры:
//  ИдентификаторЗапуска - Строка - идентификатор запуска (UUID, длина 36). Обязателен.
//  ЭтаповВсего    - Число  - см. ar_ПланЗапуска.Прогресс.Всего.
//  ЭтаповЗакрыто  - Число  - см. ar_ПланЗапуска.Прогресс.Закрыто.
//  ТекущийЭтап    - Строка - см. ar_ПланЗапуска.ТекущийПункт.Заголовок ("" если нет).
//
Процедура ЗаписатьПрогрессПлана(Знач ИдентификаторЗапуска, Знач ЭтаповВсего, Знач ЭтаповЗакрыто,
		Знач ТекущийЭтап) Экспорт

	ПроверитьИдентификаторЗапуска(ИдентификаторЗапуска);

	ЗаписьНайдена = Ложь;

	НачатьТранзакцию();
	Попытка

		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ar_Запуски");
		ЭлементБлокировки.УстановитьЗначение("ar_ИдентификаторЗапуска", ИдентификаторЗапуска);
		Блокировка.Заблокировать();

		МенеджерЗаписи = РегистрыСведений.ar_Запуски.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ar_ИдентификаторЗапуска = ИдентификаторЗапуска;
		МенеджерЗаписи.Прочитать();

		Если МенеджерЗаписи.Выбран() Тогда
			ЗаписьНайдена = Истина;
			МенеджерЗаписи.ar_ЭтаповВсего   = ЭтаповВсего;
			МенеджерЗаписи.ar_ЭтаповЗакрыто = ЭтаповЗакрыто;
			МенеджерЗаписи.ar_ТекущийЭтап   = ТекущийЭтап;
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	// Запись не найдена - пишем предупреждение в журнал и выходим без исключения
	// (по образцу Heartbeat). Логирование вынесено за пределы транзакции (std783, std498).
	Если Не ЗаписьНайдена Тогда
		ТекстПредупреждения = СтрШаблон(
			НСтр("ru = 'ЗаписатьПрогрессПлана для несуществующего идентификатора запуска: %1';
				|en = 'WriteInProgressPlan for missing run id: %1'"),
			ИдентификаторЗапуска);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'ar_AuditЗапуски.ЗаписатьПрогрессПлана'; en = 'ar_AuditЗапуски.WriteInProgressPlan'"),
			УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.РегистрыСведений.ar_Запуски,
			,
			ТекстПредупреждения);
	КонецЕсли;

КонецПроцедуры

// Найти зависшие запуски: статус в (Running, PausedForApproval) и
// ar_ПоследнийПульс старше СВОЕЙ для каждого статуса границы. Используется
// регламентным заданием ar_ОчисткаЗависших (SCHED-04). Возвращает не более 50
// записей, упорядоченных по давности heartbeat (FIFO).
//
// ДВЕ ГРАНИЦЫ, А НЕ ОДНА: молчание в этих статусах означает разное. Running -
// работает фоновое задание, и отсутствие heartbeat дольше порога это признак
// зависания. PausedForApproval - задание завершилось штатно и ждёт человека,
// обновлять heartbeat некому по определению. С общей границей sweeper убивал
// запуск через 90 секунд после постановки в очередь: оператор ещё читал
// карточку подтверждения, а run уже был Interrupted, и approval навсегда
// оставался pending.
//
// AUD-06: модуль Privileged=false (платформенное ограничение для расширений),
// поэтому запрос выполняется под привилегиями, поднятыми вызывающим фасадом
// ar_AuditЗащищённыйРежим.НайтиЗависшиеЗапускиПривилегированно (эта функция
// сама привилегий не поднимает - суффикс "БезПривилегий" в имени).
//
// Параметры:
//  ГраницаHeartbeat - Дата - запуски Running с ar_ПоследнийПульс строго раньше
//                     этой границы считаются зависшими.
//  ГраницаApproval  - Дата - то же для PausedForApproval. Необязательный: если
//                     не передан, используется ГраницаHeartbeat (поведение до
//                     разделения порогов).
//
// Возвращаемое значение:
//  Массив - элементы типа Строка (ar_ИдентификаторЗапуска). Пустой, если зависших нет.
//
Функция НайтиЗависшиеЗапускиБезПривилегий(Знач ГраницаHeartbeat,
	Знач ГраницаApproval = Неопределено) Экспорт

	Результат = Новый Массив;

	Если ГраницаApproval = Неопределено Тогда
		ГраницаApproval = ГраницаHeartbeat;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 50
		|	Запуски.ar_ИдентификаторЗапуска КАК RunId
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК Запуски
		|ГДЕ
		|	(Запуски.ar_Статус = &СтатусRunning
		|			И Запуски.ar_ПоследнийПульс < &ГраницаHeartbeat)
		|		ИЛИ (Запуски.ar_Статус = &СтатусPausedForApproval
		|			И Запуски.ar_ПоследнийПульс < &ГраницаApproval)
		|УПОРЯДОЧИТЬ ПО
		|	Запуски.ar_ПоследнийПульс";
	Запрос.УстановитьПараметр("СтатусRunning", Перечисления.ar_СтатусЗапуска.Выполняется);
	Запрос.УстановитьПараметр("СтатусPausedForApproval",
		Перечисления.ar_СтатусЗапуска.ПриостановленДляПодтверждения);
	Запрос.УстановитьПараметр("ГраницаHeartbeat", ГраницаHeartbeat);
	Запрос.УстановитьПараметр("ГраницаApproval", ГраницаApproval);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(СокрЛП(Выборка.RunId));
	КонецЦикла;

	Возврат Результат;

КонецФункции

// CONS-09, блок 1: найти кандидатов рестарта умершего процесса - запуски
// Interrupted с валидным (непустым) StateSnapshot.
//
// Ограничители безопасности (риск массового рестарта старых записей после
// первого включения задания на базе с историческими данными):
//  * ПЕРВЫЕ 50 - единичный тик не может захватить весь бэклог;
//  * ar_ЗавершенВ >= ГраницаДревности - не трогать запуски, прерванные до
//    появления этой логики (по умолчанию граница = 7 дней назад, см.
//    ar_Планировщик.ОбработатьАвтовозобновление) - старые Interrupted это
//    известное состояние SCHED-04, ожидающее ручного Resume, а не техсбой,
//    который стоит рестартовать автоматически без участия человека;
//  * ar_ПовторитьПосле НЕ заполнено ИЛИ уже в прошлом - запись, у которой
//    отдельно запланирован retry блоком 2 (см. НайтиКандидатовРетраяБезПривилегий),
//    в принципе не может иметь статус Interrupted одновременно (Interrupted и
//    Failed - взаимоисключающие значения одного перечисления), условие
//    добавлено защитно на случай будущих изменений схемы статусов.
//
// AUD-06: вызывается под привилегиями, поднятыми фасадом
// ar_AuditЗащищённыйРежим.НайтиКандидатовРестартаПривилегированно.
//
// Параметры:
//  ГраницаДревности - Дата - не рассматривать запуски с ar_ЗавершенВ раньше
//                     этой границы.
//
// Возвращаемое значение:
//  Массив - элементы типа Строка (ar_ИдентификаторЗапуска). Пустой, если кандидатов нет.
//
Функция НайтиКандидатовРестартаБезПривилегий(Знач ГраницаДревности) Экспорт

	Результат = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 50
		|	Запуски.ar_ИдентификаторЗапуска КАК RunId
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК Запуски
		|ГДЕ
		|	Запуски.ar_Статус = &СтатусInterrupted
		|	И Запуски.ar_StateSnapshot ЕСТЬ НЕ NULL
		|	И Запуски.ar_ЗавершенВ >= &ГраницаДревности
		|УПОРЯДОЧИТЬ ПО
		|	Запуски.ar_ЗавершенВ";
	Запрос.УстановитьПараметр("СтатусInterrupted", Перечисления.ar_СтатусЗапуска.Прерван);
	Запрос.УстановитьПараметр("ГраницаДревности", ГраницаДревности);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(СокрЛП(Выборка.RunId));
	КонецЦикла;

	Возврат Результат;

КонецФункции

// CONS-09, блок 2: найти кандидатов повтора техсбоя - запуски Failed с уже
// наступившим ar_ПовторитьПосле и не исчерпанным лимитом попыток.
//
// Ограничители безопасности:
//  * ПЕРВЫЕ 50;
//  * ar_ПовторитьПосле ЗАПОЛНЕНО И <= ТекущийМомент - запись без запланированного
//    retry (пустая дата, подавляющее большинство исторических Failed-записей
//    базы, созданных до появления этой логики) никогда не попадёт в выборку -
//    ar_ПовторитьПосле по умолчанию пусто и остаётся пустым, пока
//    ar_RuntimeЦикл сам не проставит его при новом транзиентном сбое;
//  * ar_ПопытокВозобновления < 3 - защитный дубль на случай гонки/бага (после
//    3-й неудачной попытки ar_RuntimeЦикл вообще не проставляет
//    ar_ПовторитьПосле, но фильтр по счётчику не полагается только на это).
//
// AUD-06: вызывается под привилегиями, поднятыми фасадом
// ar_AuditЗащищённыйРежим.НайтиКандидатовРетраяПривилегированно.
//
// Параметры:
//  ТекущийМомент - Дата - момент сравнения с ar_ПовторитьПосле (обычно
//                  ТекущаяДатаСеанса() вызывающей стороны).
//
// Возвращаемое значение:
//  Массив - элементы типа Строка (ar_ИдентификаторЗапуска). Пустой, если кандидатов нет.
//
Функция НайтиКандидатовРетраяБезПривилегий(Знач ТекущийМомент) Экспорт

	Результат = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 50
		|	Запуски.ar_ИдентификаторЗапуска КАК RunId
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК Запуски
		|ГДЕ
		|	Запуски.ar_Статус = &СтатусFailed
		|	И Запуски.ar_ПовторитьПосле <> &ПустаяДата
		|	И Запуски.ar_ПовторитьПосле <= &ТекущийМомент
		|	И Запуски.ar_ПопытокВозобновления < 3
		|УПОРЯДОЧИТЬ ПО
		|	Запуски.ar_ПовторитьПосле";
	Запрос.УстановитьПараметр("СтатусFailed", Перечисления.ar_СтатусЗапуска.ОшибкаВыполнения);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1, 1, 1));
	Запрос.УстановитьПараметр("ТекущийМомент", ТекущийМомент);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(СокрЛП(Выборка.RunId));
	КонецЦикла;

	Возврат Результат;

КонецФункции

// PLAN-13, блок 3: найти кандидатов дедлайна ожидания события - запуски
// PausedForEvent с уже истёкшим ar_ОжиданиеДо.
//
// Фильтр по ar_Статус = PausedForEvent обязателен буквально (контракт PLAN-16,
// см. .docs/specs/PLAN-13.md, «Зависимости»): запись, прерванную оператором
// (Interrupted, поля-следы ar_ОжидаетСобытия/ar_ОжиданиеДо НЕ очищены PLAN-16),
// этот фильтр не находит - её статус уже не PausedForEvent.
//
// Ограничители безопасности (тот же паттерн, что у блоков 1/2):
//  * ПЕРВЫЕ 50 - единичный тик не может захватить весь бэклог;
//  * ar_ОжиданиеДо ЗАПОЛНЕНО И <= ТекущийМомент - защитная страховка по
//    образцу ar_ПовторитьПосле в блоке 2 (см. НайтиКандидатовРетраяБезПривилегий);
//    легитимного пути получить PausedForEvent с пустым ar_ОжиданиеДо в текущем
//    коде нет (wait_for_event требует deadline_hours), условие защищает от
//    гипотетического будущего изменения схемы.
//
// AUD-06: вызывается под привилегиями, поднятыми фасадом
// ar_AuditЗащищённыйРежим.НайтиКандидатовДедлайнаПривилегированно.
//
// Параметры:
//  ТекущийМомент - Дата - момент сравнения с ar_ОжиданиеДо (обычно
//                  ТекущаяДатаСеанса() вызывающей стороны).
//
// Возвращаемое значение:
//  Массив - элементы типа Строка (ar_ИдентификаторЗапуска). Пустой, если кандидатов нет.
//
Функция НайтиКандидатовДедлайнаБезПривилегий(Знач ТекущийМомент) Экспорт

	Результат = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 50
		|	Запуски.ar_ИдентификаторЗапуска КАК RunId
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК Запуски
		|ГДЕ
		|	Запуски.ar_Статус = &СтатусPausedForEvent
		|	И Запуски.ar_ОжиданиеДо <> &ПустаяДата
		|	И Запуски.ar_ОжиданиеДо <= &ТекущийМомент
		|УПОРЯДОЧИТЬ ПО
		|	Запуски.ar_ОжиданиеДо";
	Запрос.УстановитьПараметр("СтатусPausedForEvent", Перечисления.ar_СтатусЗапуска.ПриостановленДляСобытия);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1, 1, 1));
	Запрос.УстановитьПараметр("ТекущийМомент", ТекущийМомент);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(СокрЛП(Выборка.RunId));
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Подсчитать активные запуски для rate-limiter планировщика (SCHED-05):
// число активных запусков конкретного агента и суммарное число активных запусков.
// Учитывается статус Running (фоновое задание агента выполняется) и, начиная с
// PLAN-12 (R2), также PausedForEvent — задание уже завершено (снимок сохранён),
// но запуск не может быть перезапущен параллельно, он ждёт наступления события
// (см. ar_RuntimeЗапуск.НайтиИРазбудитьСпящийЗапуск). PausedForApproval/
// PausedForInput НЕ включены — задание завершено и слот свободен, тот же вывод,
// что и до PLAN-12 (Created — переходный миг, тоже не в списке).
//
// AUD-06: модуль Privileged=false (платформенное ограничение для расширений),
// поэтому запрос выполняется под привилегиями, поднятыми вызывающим фасадом
// ar_AuditЗащищённыйРежим.ПодсчитатьАктивныеЗапускиПривилегированно (эта функция
// сама привилегий не поднимает - суффикс "БезПривилегий" в имени).
//
// Параметры:
//  СсылкаАгент - СправочникСсылка.ar_Агенты - агент для per-agent подсчёта.
//
// Возвращаемое значение:
//  Структура - ровно два числовых ключа:
//    * ПоАгенту      - Число - активных запусков (Running/PausedForEvent) с
//                      ar_АгентРеф = СсылкаАгент.
//    * ВсегоАктивных - Число - всех активных запусков (без фильтра по агенту).
//
Функция ПодсчитатьАктивныеЗапускиБезПривилегий(Знач СсылкаАгент) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(*) КАК ВсегоАктивных,
		|	ЕСТЬNULL(СУММА(ВЫБОР КОГДА Запуски.ar_АгентРеф = &Агент ТОГДА 1 ИНАЧЕ 0 КОНЕЦ), 0) КАК ПоАгенту
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК Запуски
		|ГДЕ
		|	Запуски.ar_Статус В (&СтатусRunning, &СтатусPausedForEvent)";
	Запрос.УстановитьПараметр("Агент", СсылкаАгент);
	Запрос.УстановитьПараметр("СтатусRunning", Перечисления.ar_СтатусЗапуска.Выполняется);
	Запрос.УстановитьПараметр("СтатусPausedForEvent", Перечисления.ar_СтатусЗапуска.ПриостановленДляСобытия);

	Выборка = Запрос.Выполнить().Выбрать();

	ВсегоАктивных = 0;
	ПоАгенту = 0;
	Если Выборка.Следующий() Тогда
		// При нуле записей агрегаты КОЛИЧЕСТВО(*) = 0, а СУММА(...) = NULL.
		// NULL из запроса - это ТИП NULL, а не Неопределено: проверка
		// "= Неопределено" его НЕ ловит, и в ПоАгенту попадал NULL, из-за чего
		// сравнение "Счётчики.ПоАгенту >= ЛимитАгента" в ar_Планировщик падало с
		// "Greater than/Less than compare operations allowed only for values of
		// similar primitive types" на каждом тике планировщика. Снято ЕСТЬNULL
		// в самом запросе (выше) + страховка по типу здесь.
		ВсегоАктивных = ?(ТипЗнч(Выборка.ВсегоАктивных) = Тип("Число"), Выборка.ВсегоАктивных, 0);
		ПоАгенту = ?(ТипЗнч(Выборка.ПоАгенту) = Тип("Число"), Выборка.ПоАгенту, 0);
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("ПоАгенту", ПоАгенту);
	Результат.Вставить("ВсегоАктивных", ВсегоАктивных);
	Возврат Результат;

КонецФункции

// Сохранить снимок состояния цикла рассуждения для последующего возобновления
// после approval-паузы.
//
// Параметры:
//  ИдентификаторЗапуска - Строка - идентификатор запуска. Обязателен.
//  ДанныеСостояния - Структура, Соответствие, Массив или примитив — содержимое state.
//                    Должно состоять только из сериализуемых типов (без HTTPСоединение,
//                    потоков, объектов форм, ЗаписьJSON/ЧтениеJSON). Ссылки на объекты
//                    ИБ передавать как НавигационнаяСсылка (строка).
//
Процедура СохранитьСнимок(ИдентификаторЗапуска, ДанныеСостояния) Экспорт

	ПроверитьИдентификаторЗапуска(ИдентификаторЗапуска);
	ПроверитьСериализуемость(ДанныеСостояния);

	Снимок = Новый Соответствие;
	Снимок.Вставить("v", 1);
	Снимок.Вставить("state", ДанныеСостояния);

	Хранилище = Новый ХранилищеЗначения(Снимок, Новый СжатиеДанных(9));

	НачатьТранзакцию();
	Попытка

		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ar_Запуски");
		ЭлементБлокировки.УстановитьЗначение("ar_ИдентификаторЗапуска", ИдентификаторЗапуска);
		Блокировка.Заблокировать();

		МенеджерЗаписи = РегистрыСведений.ar_Запуски.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ar_ИдентификаторЗапуска = ИдентификаторЗапуска;
		МенеджерЗаписи.Прочитать();

		Если Не МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.ar_ИдентификаторЗапуска = ИдентификаторЗапуска;
		КонецЕсли;

		МенеджерЗаписи.ar_StateSnapshot = Хранилище;
		МенеджерЗаписи.Записать(Истина);

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// Прочитать текущее значение счётчика повторов техсбоя (CONS-09) для ИдентификатораЗапуска.
// Используется ar_RuntimeЦикл в момент падения LLM-вызова, чтобы посчитать
// номер попытки, которую предстоит запланировать (пауза 1/5/15 минут).
//
// Параметры:
//  ИдентификаторЗапуска - Строка - идентификатор запуска. Обязателен.
//
// Возвращаемое значение:
//  Число - текущее значение ar_ПопытокВозобновления; 0, если запись не найдена.
//
Функция ПрочитатьПопытокВозобновления(ИдентификаторЗапуска) Экспорт

	ПроверитьИдентификаторЗапуска(ИдентификаторЗапуска);

	МенеджерЗаписи = РегистрыСведений.ar_Запуски.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ar_ИдентификаторЗапуска = ИдентификаторЗапуска;
	МенеджерЗаписи.Прочитать();

	Если Не МенеджерЗаписи.Выбран() Тогда
		Возврат 0;
	КонецЕсли;

	Возврат МенеджерЗаписи.ar_ПопытокВозобновления;

КонецФункции

// CONS-11: прочитать отпечаток прохода, записанный на предыдущем завершении
// цикла того же ИдентификатораЗапуска (слой 2, result-aware сравнение). Пустая строка -
// либо запись не найдена, либо отпечаток ещё не вычислялся (первый проход).
//
// Параметры:
//  ИдентификаторЗапуска - Строка - идентификатор запуска. Обязателен.
//
// Возвращаемое значение:
//  Строка - hex SHA-256 (64 символа) либо "".
//
Функция ПрочитатьОтпечатокШага(ИдентификаторЗапуска) Экспорт

	ПроверитьИдентификаторЗапуска(ИдентификаторЗапуска);

	МенеджерЗаписи = РегистрыСведений.ar_Запуски.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ar_ИдентификаторЗапуска = ИдентификаторЗапуска;
	МенеджерЗаписи.Прочитать();

	Если Не МенеджерЗаписи.Выбран() Тогда
		Возврат "";
	КонецЕсли;

	Возврат ?(ТипЗнч(МенеджерЗаписи.ar_ОтпечатокШага) = Тип("Строка"), МенеджерЗаписи.ar_ОтпечатокШага, "");

КонецФункции

// CONS-11: прочитать текущее значение счётчика продолжений (слой 3,
// предохранитель потолка 10). НЕ ar_ПопытокВозобновления (CONS-09, счётчик
// техповторов, потолок 3) - см. Comment ресурса ar_ПродолженийСделано.
//
// Параметры:
//  ИдентификаторЗапуска - Строка - идентификатор запуска. Обязателен.
//
// Возвращаемое значение:
//  Число - текущее значение ar_ПродолженийСделано; 0, если запись не найдена.
//
Функция ПрочитатьПродолженийСделано(ИдентификаторЗапуска) Экспорт

	ПроверитьИдентификаторЗапуска(ИдентификаторЗапуска);

	МенеджерЗаписи = РегистрыСведений.ar_Запуски.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ar_ИдентификаторЗапуска = ИдентификаторЗапуска;
	МенеджерЗаписи.Прочитать();

	Если Не МенеджерЗаписи.Выбран() Тогда
		Возврат 0;
	КонецЕсли;

	Возврат МенеджерЗаписи.ar_ПродолженийСделано;

КонецФункции

// Прочитать снимок состояния цикла рассуждения.
//
// Параметры:
//  ИдентификаторЗапуска - Строка - идентификатор запуска. Обязателен.
//
// Возвращаемое значение:
//  Структура - {v: Число, state: Произвольный} если снимок есть и формат совместим;
//  Неопределено - если запись не найдена, снимок пуст, или версия формата несовместима.
//
//  При несовместимой версии — пишет событие "incompatible_snapshot" в журнал
//  регистрации (вызывающий код должен установить статус FailedIncompatibleState).
//
Функция ПрочитатьСнимок(ИдентификаторЗапуска) Экспорт

	ПроверитьИдентификаторЗапуска(ИдентификаторЗапуска);

	МенеджерЗаписи = РегистрыСведений.ar_Запуски.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ar_ИдентификаторЗапуска = ИдентификаторЗапуска;
	МенеджерЗаписи.Прочитать();

	Если Не МенеджерЗаписи.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Хранилище = МенеджерЗаписи.ar_StateSnapshot;
	Если Хранилище = Неопределено Или ТипЗнч(Хранилище) <> Тип("ХранилищеЗначения") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Снимок = Хранилище.Получить();
	Если Снимок = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Версия = Неопределено;
	Состояние = Неопределено;
	РазобратьСнимок(Снимок, Версия, Состояние);

	// Версионирование: если версия снимка не совпадает с текущей версией формата
	// ядра — делегируем мигратору (RT-09). Мигратор либо апгрейдит снимок до
	// текущей версии, либо отказывает (снимок новее ядра / неизвестный формат).
	Если Версия <> ar_СнимокМигратор.ТекущаяВерсия() Тогда
		РезМиграции = ar_СнимокМигратор.Мигрировать(Снимок, Версия);
		Если Не РезМиграции.Успех Тогда
			ШаблонСобытия = НСтр("ru = 'incompatible_snapshot: RunId=%1, версия=%2, причина=%3';
				|en = 'incompatible_snapshot: RunId=%1, version=%2, reason=%3'");
			ТекстСобытия = СтрШаблон(ШаблонСобытия, ИдентификаторЗапуска, Строка(Версия), РезМиграции.Причина);
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'ar_AuditЗапуски.ПрочитатьСнимок'; en = 'ar_AuditЗапуски.ReadSnapshot'"),
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.РегистрыСведений.ar_Запуски,
				,
				ТекстСобытия);
			Возврат Неопределено;
		КонецЕсли;

		// Перечитать v/state из мигрированного снимка (тип может быть Структура
		// или Соответствие — мигратор возвращает то, что вернул шаг миграции).
		Снимок = РезМиграции.Снимок;
		Версия = Неопределено;
		Состояние = Неопределено;
		РазобратьСнимок(Снимок, Версия, Состояние);
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("v", Версия);
	Результат.Вставить("state", Состояние);
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Истина, если статус является финальным — повторный перевод в Interrupted/иной
// финальный статус не выполняется (SCHED-04, UC-3). Финальные статусы:
// Completed, Failed, Cancelled, Interrupted, FailedIncompatibleState.
//
// Параметры:
//  Статус - ПеречислениеСсылка.ar_СтатусЗапуска - проверяемый статус.
//
// Возвращаемое значение:
//  Булево - Истина, если статус финальный.
//
Функция ЭтоФинальныйСтатус(Знач Статус)

	ФинальныеСтатусы = Новый Массив;
	ФинальныеСтатусы.Добавить(Перечисления.ar_СтатусЗапуска.Завершён);
	ФинальныеСтатусы.Добавить(Перечисления.ar_СтатусЗапуска.ОшибкаВыполнения);
	ФинальныеСтатусы.Добавить(Перечисления.ar_СтатусЗапуска.Отменён);
	ФинальныеСтатусы.Добавить(Перечисления.ar_СтатусЗапуска.Прерван);
	ФинальныеСтатусы.Добавить(Перечисления.ar_СтатусЗапуска.ОшибкаНесовместимоеСостояние);

	Возврат ФинальныеСтатусы.Найти(Статус) <> Неопределено;

КонецФункции

// Извлечь поля v и state из снимка независимо от его типа (Структура или
// Соответствие). Для нестандартных типов оба выходных параметра остаются
// Неопределено.
//
// Параметры:
//  Снимок     - Структура, Соответствие, Произвольный - прочитанный снимок.
//  Версия     - Произвольный - выходной: значение поля "v" (или Неопределено).
//  Состояние  - Произвольный - выходной: значение поля "state" (или Неопределено).
//
Процедура РазобратьСнимок(Снимок, Версия, Состояние)

	Если ТипЗнч(Снимок) = Тип("Соответствие") Тогда
		Версия = Снимок.Получить("v");
		Состояние = Снимок.Получить("state");
	ИначеЕсли ТипЗнч(Снимок) = Тип("Структура") Тогда
		Снимок.Свойство("v", Версия);
		Снимок.Свойство("state", Состояние);
	Иначе
		// Нестандартный тип снимка: v и state остаются Неопределено,
		// что приведёт к отказу совместимости в вызывающем коде.
		Версия = Неопределено;
		Состояние = Неопределено;
	КонецЕсли;

КонецПроцедуры

// Проверить корректность входных параметров. При нарушении контракта выбрасывает
// исключение с локализованным текстом.
//
Процедура ПроверитьПараметры(ИдентификаторЗапуска, СтруктураДанных)

	ПроверитьИдентификаторЗапуска(ИдентификаторЗапуска);

	Если ТипЗнч(СтруктураДанных) <> Тип("Структура") Тогда
		ВызватьИсключение НСтр("ru = 'ar_AuditЗапуски: СтруктураДанных должна быть типа Структура';
								|en = 'ar_AuditЗапуски: СтруктураДанных must be of type Structure'");
	КонецЕсли;

	Если Не СтруктураДанных.Свойство("Статус") Или Не ЗначениеЗаполнено(СтруктураДанных.Статус) Тогда
		ВызватьИсключение НСтр("ru = 'ar_AuditЗапуски: Статус обязателен';
								|en = 'ar_AuditЗапуски: Status is required'");
	КонецЕсли;

КонецПроцедуры

// Проверка ИдентификатораЗапуска.
//
Процедура ПроверитьИдентификаторЗапуска(ИдентификаторЗапуска)

	Если ТипЗнч(ИдентификаторЗапуска) <> Тип("Строка") Или ПустаяСтрока(ИдентификаторЗапуска) Тогда
		ВызватьИсключение НСтр("ru = 'ar_AuditЗапуски: RunId не может быть пустым';
								|en = 'ar_AuditЗапуски: RunId cannot be empty'");
	КонецЕсли;

КонецПроцедуры

// Преобразовать статус (Строка или ПеречислениеСсылка) в ссылку на перечисление
// ar_СтатусЗапуска. Обеспечивает обратную совместимость с прото-кодом, который
// передавал статус строкой ("running", "completed" и т. д.).
//
Функция СтатусСсылкой(Знач Статус)

	Если ТипЗнч(Статус) = Тип("ПеречислениеСсылка.ar_СтатусЗапуска") Тогда
		Возврат Статус;
	КонецЕсли;

	Если ТипЗнч(Статус) = Тип("Строка") Тогда
		// Маппинг прото-имён на канонические значения перечисления (META-08).
		Соответствие = СоответствиеСтрокаНаПеречисление();
		Каноническое = Соответствие.Получить(НРег(Статус));
		Если Каноническое <> Неопределено Тогда
			Возврат Перечисления.ar_СтатусЗапуска[Каноническое];
		КонецЕсли;

		// Прямой доступ по имени значения перечисления (для совместимости).
		Попытка
			Возврат Перечисления.ar_СтатусЗапуска[Статус];
		Исключение
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'ar_AuditЗапуски: неизвестный Статус ""%1""';
					|en = 'ar_AuditЗапуски: unknown Status ""%1""'"),
				Статус);
		КонецПопытки;
	КонецЕсли;

	ВызватьИсключение НСтр("ru = 'ar_AuditЗапуски: Статус должен быть ПеречислениеСсылка.ar_СтатусЗапуска или Строка';
							|en = 'ar_AuditЗапуски: Status must be EnumRef.ar_СтатусЗапуска or String'");

КонецФункции

// Маппинг прото-имён статусов (строки) на значения перечисления ar_СтатусЗапуска.
//
Функция СоответствиеСтрокаНаПеречисление()

	Соответствие = Новый Соответствие;
	Соответствие.Вставить("created", "Создан");
	Соответствие.Вставить("running", "Выполняется");
	Соответствие.Вставить("pausedforapproval", "ПриостановленДляПодтверждения");
	Соответствие.Вставить("completed", "Завершён");
	Соответствие.Вставить("failed", "ОшибкаВыполнения");
	Соответствие.Вставить("cancelled", "Отменён");
	Соответствие.Вставить("maxstepsreached", "ДостигнутМаксимумШагов");
	Соответствие.Вставить("deniedglobally", "ОтклонёнГлобально");
	Соответствие.Вставить("interrupted", "Прерван");
	Соответствие.Вставить("failedincompatiblestate", "ОшибкаНесовместимоеСостояние");
	Возврат Соответствие;

КонецФункции

// Записать данные запуска в регистр ar_Запуски через менеджер записи.
// Менеджер записи перезаписывает существующую запись с тем же ключом —
// поведение идемпотентно для Создать/Завершить.
//
Процедура ЗаписатьЗапуск(ИдентификаторЗапуска, СтруктураДанных)

	НачатьТранзакцию();
	Попытка

		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ar_Запуски");
		ЭлементБлокировки.УстановитьЗначение("ar_ИдентификаторЗапуска", ИдентификаторЗапуска);
		Блокировка.Заблокировать();

		МенеджерЗаписи = РегистрыСведений.ar_Запуски.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ar_ИдентификаторЗапуска = ИдентификаторЗапуска;
		МенеджерЗаписи.Прочитать();
		Если Не МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.ar_ИдентификаторЗапуска = ИдентификаторЗапуска;
		КонецЕсли;

		Если СтруктураДанных.Свойство("Статус") И ЗначениеЗаполнено(СтруктураДанных.Статус) Тогда
			МенеджерЗаписи.ar_Статус = СтатусСсылкой(СтруктураДанных.Статус);
		КонецЕсли;

		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ОтветLLM",         СтруктураДанных, "ОтветLLM");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_АгентРеф",          СтруктураДанных, "АгентРеф");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_СтартовалВ",        СтруктураДанных, "СтартовалВ");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ЗавершенВ",         СтруктураДанных, "ЗавершенВ");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_Триггер",           СтруктураДанных, "Триггер");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ПользовательРеф",   СтруктураДанных, "ПользовательРеф");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ТокеновВход",       СтруктураДанных, "ТокеновВход");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ТокеновВыход",      СтруктураДанных, "ТокеновВыход");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_СтоимостьРуб",      СтруктураДанных, "СтоимостьРуб");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ШаговВсего",        СтруктураДанных, "ШаговВсего");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_РодительскийИдентификаторЗапуска", СтруктураДанных, "РодительскийИдентификаторЗапуска");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ПоследнийПульс",     СтруктураДанных, "ПоследнийПульс");
		// CONS-02: профиль запуска - опционален, пустая ссылка/отсутствие ключа
		// не меняет запись (обратная совместимость, решение 22).
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ПрофильЗапуска",    СтруктураДанных, "ПрофильЗапуска");
		// CONS-09: планирование/сброс техповтора. ПовторитьПосле передаётся явно
		// как Дата() (пустая) для очистки признака ожидания - ПрисвоитьЕслиЕсть
		// пропускает только Неопределено, поэтому очистка проходит нормально.
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ПовторитьПосле",       СтруктураДанных, "ПовторитьПосле");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ПопытокВозобновления", СтруктураДанных, "ПопытокВозобновления");
		// agentrunner-26 п.4: диалог и предмет запуска (заполняются вызывающей
		// стороной из КонтекстТриггера; при отсутствии ключей запись не меняется).
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_Диалог",  СтруктураДанных, "Диалог");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_Предмет", СтруктураДанных, "Предмет");
		// CONS-10: вердикт надзора о достижении цели ("ЦельДостигнута"/
		// "Продолжить"/"Эскалировать") - строкой, совпадающей с именем значения
		// ar_ВердиктНадзора. ПрисвоитьЕслиЕсть пропускает ключ, если надзор
		// не вызывался (Failed/PausedForApproval/... - см. ar_Надзор).
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ПоследнееРешениеНадзора", СтруктураДанных, "ПоследнееРешениеНадзора");
		// CONS-11: отпечаток последнего прохода (SHA-256, hex) для result-aware
		// сравнения слоя 2 при следующем вызове ar_Надзор.ПроверитьДостижениеЦели
		// того же идентификатора запуска. Пустая строка тоже допустимое значение (случай (г) в
		// спеке) - ПрисвоитьЕслиЕсть пропускает только Неопределено.
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ОтпечатокШага",         СтруктураДанных, "ОтпечатокШага");
		// CONS-11: счётчик продолжений (слой 3, предохранитель потолка 10) -
		// НЕ ar_ПопытокВозобновления (CONS-09, счётчик техповторов, потолок 3).
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ПродолженийСделано",    СтруктураДанных, "ПродолженийСделано");
		// PLAN-04: прогресс плана работы агента (update_plan) - источник
		// значений ar_ПланЗапуска.Прогресс/ТекущийПункт, вставляется вызывающей
		// стороной (ar_RuntimeЦикл.ДополнитьДаннымиПлана) только когда план
		// фактически использовался в запуске - на агентах без планирования
		// ключи отсутствуют в структуре, ПрисвоитьЕслиЕсть их не пишет (S2).
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ТекущийЭтап",    СтруктураДанных, "ТекущийЭтап");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ЭтаповВсего",    СтруктураДанных, "ЭтаповВсего");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ЭтаповЗакрыто",  СтруктураДанных, "ЭтаповЗакрыто");
		// PLAN-11: пауза wait_for_event - вставляется вызывающей стороной
		// (ar_RuntimeЦикл, ветка «7б») только при постановке PausedForEvent -
		// ПрисвоитьЕслиЕсть пропускает ключи на всех остальных путях завершения
		// запуска (тот же принцип, что и у ar_ТекущийЭтап/ЭтаповВсего/
		// ЭтаповЗакрыто, PLAN-04, S2).
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ОжидаетСобытия", СтруктураДанных, "ОжидаетСобытия");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ОжиданиеДо",     СтруктураДанных, "ОжиданиеДо");

		МенеджерЗаписи.Записать(Истина);

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// Наследование диалога и предмета родительского запуска (agentrunner-26 п.4):
// если в СтруктураДанных нет "Диалог"/"Предмет", но задан
// РодительскийИдентификаторЗапуска - значения читаются из записи родителя.
//
Процедура НаследоватьДанныеРодителя(Знач ИдентификаторЗапуска, СтруктураДанных)

	Если СтруктураДанных.Свойство("Диалог") И СтруктураДанных.Свойство("Предмет") Тогда
		Возврат;
	КонецЕсли;

	РодительскийИдентификатор = "";
	Если СтруктураДанных.Свойство("РодительскийИдентификаторЗапуска", РодительскийИдентификатор) Тогда
		РодительскийИдентификатор = СокрЛП(РодительскийИдентификатор);
	КонецЕсли;
	Если ПустаяСтрока(РодительскийИдентификатор) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Родитель.ar_Диалог КАК Диалог,
		|	Родитель.ar_Предмет КАК Предмет
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК Родитель
		|ГДЕ
		|	Родитель.ar_ИдентификаторЗапуска = &Родитель";
	Запрос.УстановитьПараметр("Родитель", РодительскийИдентификатор);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Не СтруктураДанных.Свойство("Диалог") И ЗначениеЗаполнено(Выборка.Диалог) Тогда
			СтруктураДанных.Вставить("Диалог", Выборка.Диалог);
		КонецЕсли;
		Если Не СтруктураДанных.Свойство("Предмет") И ЗначениеЗаполнено(Выборка.Предмет) Тогда
			СтруктураДанных.Вставить("Предмет", Выборка.Предмет);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Присвоить значение реквизита менеджера записи, если ключ есть в структуре
// и значение не Неопределено.
//
Процедура ПрисвоитьЕслиЕсть(МенеджерЗаписи, ИмяРеквизита, СтруктураДанных, КлючСтруктуры)

	Если СтруктураДанных.Свойство(КлючСтруктуры) И СтруктураДанных[КлючСтруктуры] <> Неопределено Тогда
		МенеджерЗаписи[ИмяРеквизита] = СтруктураДанных[КлючСтруктуры];
	КонецЕсли;

КонецПроцедуры

// Проверка типов содержимого state перед сериализацией в ХранилищеЗначения.
// Допустимы: Структура, Соответствие, Массив, ФиксированноеСоответствие,
// ФиксированнаяСтруктура, ФиксированныйМассив, примитивы (Строка, Число,
// Булево, Дата, Неопределено, УникальныйИдентификатор). Ссылки на объекты
// ИБ ожидаются строками (НавигационнаяСсылка).
//
Процедура ПроверитьСериализуемость(Знач Значение)

	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТипЗначения = ТипЗнч(Значение);
	ДопустимыеПримитивы = Новый Массив;
	ДопустимыеПримитивы.Добавить(Тип("Строка"));
	ДопустимыеПримитивы.Добавить(Тип("Число"));
	ДопустимыеПримитивы.Добавить(Тип("Булево"));
	ДопустимыеПримитивы.Добавить(Тип("Дата"));
	ДопустимыеПримитивы.Добавить(Тип("УникальныйИдентификатор"));

	Если ДопустимыеПримитивы.Найти(ТипЗначения) <> Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗначения = Тип("Структура") Или ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		Для Каждого КлючЗначение Из Значение Цикл
			ПроверитьСериализуемость(КлючЗначение.Значение);
		КонецЦикла;
		Возврат;
	КонецЕсли;

	Если ТипЗначения = Тип("Соответствие") Или ТипЗначения = Тип("ФиксированноеСоответствие") Тогда
		Для Каждого КлючЗначение Из Значение Цикл
			ПроверитьСериализуемость(КлючЗначение.Значение);
		КонецЦикла;
		Возврат;
	КонецЕсли;

	Если ТипЗначения = Тип("Массив") Или ТипЗначения = Тип("ФиксированныйМассив") Тогда
		Для Каждого Элемент Из Значение Цикл
			ПроверитьСериализуемость(Элемент);
		КонецЦикла;
		Возврат;
	КонецЕсли;

	// Ссылки на объекты ИБ формально сериализуются в ХранилищеЗначения, но при
	// Получить() на другой базе/после реструктуризации возвращаются как
	// Неопределено: состояние loop молча теряется. Запрещаем явно: ссылки в
	// snapshot должны передаваться строкой (ПолучитьНавигационнуюСсылку),
	// см. RT-08, риск "ПроверитьСериализуемость не покрывает ссылочные типы".
	Если ЭтоСсылочныйТип(ИмяТипа(ТипЗначения)) Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'ar_AuditЗапуски.СохранитьСнимок: ссылка на объект ИБ в state недопустима: ""%1"". Передавайте ссылки строкой (ПолучитьНавигационнуюСсылку)';
				|en = 'ar_AuditЗапуски.СохранитьСнимок: infobase reference in state is not allowed: ""%1"". Pass references as a string (GetURL)'"),
			ИмяТипа(ТипЗначения));
	КонецЕсли;

	ВызватьИсключение СтрШаблон(
		НСтр("ru = 'ar_AuditЗапуски.СохранитьСнимок: недопустимый тип в state: ""%1""';
			|en = 'ar_AuditЗапуски.СохранитьСнимок: disallowed type in state: ""%1""'"),
		ИмяТипа(ТипЗначения));

КонецПроцедуры

// Строковое имя типа (для сообщений об ошибке и анализа ссылочности).
//
Функция ИмяТипа(ТипЗначения)
	Возврат Строка(ТипЗначения);
КонецФункции

// Признак того, что имя типа соответствует ссылке на объект ИБ
// (СправочникСсылка.*, ДокументСсылка.*, ПеречислениеСсылка.*, БизнесПроцессСсылка.*,
// ЗадачаСсылка.*, ПланВидовХарактеристикСсылка.*, ПланСчетовСсылка.*,
// ПланОбменаСсылка.*, ПланВидовРасчетаСсылка.*) либо ключу записи регистра.
// Проверяется по точному суффиксу слова до первой точки, чтобы исключить
// ложные срабатывания на бизнес-именах вроде "СсылкиНаДокументы".
//
Функция ЭтоСсылочныйТип(ИмяТипа)

	// Все ссылочные типы и ключи записи имеют вид "Префикс.Имя" (с точкой),
	// например "СправочникСсылка.Контрагенты". Отсутствие точки исключает
	// ложные срабатывания на примитивах и бизнес-именах.
	ПозицияТочки = СтрНайти(ИмяТипа, ".");
	Если ПозицияТочки = 0 Тогда
		Возврат Ложь;
	КонецЕсли;

	ЧастьДоТочки = Лев(ИмяТипа, ПозицияТочки - 1);
	Возврат ПравоеЗначениеСовпадает(ЧастьДоТочки, "Ссылка")
		Или ПравоеЗначениеСовпадает(ЧастьДоТочки, "КлючЗаписи");

КонецФункции

// Истина, если Строка заканчивается на Окончание.
//
Функция ПравоеЗначениеСовпадает(Строка, Окончание)
	Если СтрДлина(Строка) < СтрДлина(Окончание) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Прав(Строка, СтрДлина(Окончание)) = Окончание;
КонецФункции

#КонецОбласти
